Repository: PI316-1-Var2/Software-Construction-Lab
Catalog: Control/Globalization/UIGlobalization.*.resx
Languages: uk_ua

# CaloriesAlert
source: Calories calculated:
uk_ua: Підрахунок калорій:

source: Carbohydrates
uk_ua: Вуглеводи

source: Command:
uk_ua: Команда:

# VisitorName
source: Customer name
uk_ua: Ім'я Клієнта:

source: Date ordered
uk_ua: Дата замовлення

# DishGetCommands
source: 1. - get dish by Id; 2. - get all dishes; 3. - add dish; 4. - remove dish by Id; 5. - edit dish; 0. - return to home screen.
uk_ua: 1. - отримати страву по id; 2. - отримати усі страви; 3. - додати страву; 4. - видали страву по id; 5. - редагувати страву; 0. - повернутися назад.

source: Dish name
uk_ua: Назва страви

source: Energy
uk_ua: Енергія

source: Fat
uk_ua: Жири

# FitnessGetCommands
source: 1. - get visitor by Id; 2. - get all visitors; 3. - add visitor; 4. - remove visitor by Id; 5. - edit visitor; 6. - calculate calories(Format: VisitorId|RecieptDate); 0. - return to home screen.
uk_ua: 1. - отримати користувача по id; 2. - отримати усіх користувачів; 3. - додати користувача; 4. - видалити користувача по id; 5. - редагувати користувача; 6. - порахувати калорії(Формат: IdКлієнта|ДатаЧеку); 0. - повернутися назад.

# FitnessInputHeader
source: FitnessController (Body format: Id|Name|Height|Weight)
uk_ua: ФітнесКонтролер (Формат тіла: Id|Ім'я|Зріст|Вага)

source: Height
uk_ua: Зріст

source: Ingredients
uk_ua: Інгредієнти

# KitchenInputHeader
source: KitchenController (Body format: Id|Name|Price|Product Ids) Product Ids are separated by commas
uk_ua: КухняКонтролер (Формат тіла: Id|Ім'я|Ціна|Id Продуктів) Id Продуктів мають бути перераховані через кому

# ListGetAlert
source: Objects info:
uk_ua: Інформація про об'єкти:

source: Name
uk_ua: Ім'я

# ObjectAddAlert
source: Obect was successfully created:
uk_ua: Об'єкт був успішно створений;

# ObjectChangeAlert
source: Obect was successfully changed:
uk_ua: Об'єкт був успішно змінений;

# ObjectGetAlert
source: Object info:
uk_ua: Інформація про об'єкти:

# ObjectGetCommands
source: 1. - get item by Id; 2. - get all items; 3. - add item; 4. - remove item by Id; 5. - edit item; 0. - return to home screen.
uk_ua: 1. - отримати елемент по id; 2. - отримати усі елементи; 3. - додати елемент; 4. - видалити елемент по id; 5. - змінити елемент; 0. - повернутися назад.

# ObjectRemoveAlert
source: Obect was successfully removed:
uk_ua: Об'єкт був успішно видалений;

source: Price
uk_ua: Ціна

# ProductGetCommands
source: 1. - get product by Id; 2. - get all products; 3. - add product; 4. - remove product by Id; 5. - edit product; 0. - return to home screen.
uk_ua: 1. - отримати продукт по id; 2. - отримати усі продукти; 3. - додати продукт; 4. - видалити продукт по id; 5. - редагувати продукт; 0. - повернутися на початкову сторінку.

# ProductInputHeader
source: ProductController (Body format: Id|Name|Energy|Protein|Fat|Carbohydrates)
uk_ua: ПродуктКонтролер (Формат тіла: Id|Ім'я|Енергія|Білки|Жири|Вуглеводи)

source: Protein
uk_ua: Білки

source: Quantity
uk_ua: Кількість

# RecieptGetCommands
source: 1. - get reciept by Id; 2. - get all reciepts; 3. - reciept for last # days; 4. - add reciept; 5. - remove reciept by Id; 6. - edit reciept; 7. - create reciept(Format: VisitorId|Date); 0. - return to home screen.
uk_ua: 1. - отримати чек по id; 2. - отримати чеки за останні # днів; 3. - отримати усі чеки; 4. - додати чек; 5. - видали чек по id; 6. - редагувати чек; 7. - створити чек (Формат: IDКлієнта|Дата); 0. - повернутися назад.

# RecieptInfo
source: Check info:
uk_ua: Чек-Інформація:

# RecieptInputHeader
source: Check controller (Body format: Id|DishId|Quantity|CustomerId|Date_Order) Date format: dd-MM-yyyy-hh-mm-ss
uk_ua: Чек контролер (Формат тіла: Id|IdСтрави|Кількість|IdКористувача|Дата_Замовлення) Формат дати: dd-MM-yyyy-hh-mm-ss

source: Request body:
uk_ua: Тіло запиту:

# UnexpectedAlert
source: Unexpected error. Try again later.
uk_ua: Неочікувана помилка. Спробуйте ще раз.

# WarehouseInputHeader
source: WarehouseController (Body format: Id|ProductId|Quantity)
uk_ua: КонтролерСкладу (Формат тіла: Id|IdПродукту|Кількість)

source: Weight
uk_ua: Вага

# WelcomeScreen
source: Choose a controller: 1. - product controller; 2. - kitchen (dish) controller; 3. - warehouse controller; 4. - check controller; 5. - fitness controlles; 0.- exit.
uk_ua: Виберіть контроллер: 1. - Продукти; 2. - Кухня (страви); 3. - Склад; 4. - Каса; 5. - Фітнес; 0. - Вихід.

source: Incorrect command!
uk_ua: Невірна команда!

# IncorrectFormatAlert
source: Incorrect format. Try again.
uk_ua: Невірний формат. Спробуйте знову.

# IncorrectIdAlert
source: Incorrect IDs. Try again.
uk_ua: Неправильні Id. Спробуйте знову.
